obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
/***
* author:xnby
* platform: esp
* version: 1.0.0
* UIResolution: 480*320
*/

#include "qm_ui_entry.h"
#include "cJSON.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "lv_8ms_blockly.h"
#include "wtctrl.h"

#include "driver/adc.h"
#include "esp_adc_cal.h"

typedef struct
{
    char *name;
    lv_obj_t **id;
} lv_widget_t;

typedef struct
{
    char *name;
    lv_obj_t **id;
    lv_widget_t *wids;
    int len;
} lv_screen_t;

void lvgl_blockly_loop();
void lvgl_blockly_init();
/*
* includes
*/
LV_IMG_DECLARE(img1629631902349_png);
LV_IMG_DECLARE(img1629631379159_png);
LV_IMG_DECLARE(img1629631072036_png);
LV_IMG_DECLARE(img1627313837606_png);
LV_IMG_DECLARE(img1627313782026_png);
LV_IMG_DECLARE(img1627300974397_png);
LV_IMG_DECLARE(img1627300907204_png);
LV_IMG_DECLARE(img1627300869095_png);
LV_IMG_DECLARE(img1627300495627_png);
LV_IMG_DECLARE(img1627300475973_png);
LV_IMG_DECLARE(img1627285685903_png);
LV_IMG_DECLARE(img1627285659756_png);
LV_IMG_DECLARE(img1627285614032_png);
LV_IMG_DECLARE(img1627285431674_png);
LV_IMG_DECLARE(img1624810488518_JPG);
LV_IMG_DECLARE(img1627284951998_png);
LV_IMG_DECLARE(img1627285477548_png);
LV_IMG_DECLARE(img1627285517798_png);
LV_IMG_DECLARE(img1624810449186_jpg);
LV_IMG_DECLARE(img1624810438726_jpg);
LV_IMG_DECLARE(img1624810316180_JPG);
LV_IMG_DECLARE(img1624810282247_JPG);
LV_IMG_DECLARE(img1623066088293_jpg);
LV_IMG_DECLARE(img1623066079363_jpg);
LV_IMG_DECLARE(img1623066069081_jpg);
LV_IMG_DECLARE(img1622133209398_png);
LV_IMG_DECLARE(img1622133193178_png);
LV_IMG_DECLARE(img1621964575797_png);
LV_IMG_DECLARE(img1621964562882_jpeg);
LV_IMG_DECLARE(img1621964554083_jpeg);
LV_IMG_DECLARE(img1621808007284_jpg);
LV_IMG_DECLARE(img1621807977916_jpg);
LV_IMG_DECLARE(img1621807987411_jpg);
LV_IMG_DECLARE(img1621807899832_jpg);
LV_IMG_DECLARE(img1621412246918_png);
LV_IMG_DECLARE(img1621411957578_png);
LV_IMG_DECLARE(img1621411781237_png);
LV_IMG_DECLARE(img1621411672830_png);
LV_IMG_DECLARE(img1621411653680_png);
LV_IMG_DECLARE(img1621411366311_png);
LV_IMG_DECLARE(img1621411186442_png);
LV_IMG_DECLARE(img1621411142878_png);
LV_IMG_DECLARE(img1621411133904_png);
LV_IMG_DECLARE(img1620925138709_png);
LV_IMG_DECLARE(img1620925120786_png);
LV_IMG_DECLARE(img1618503703351_jpg);
LV_IMG_DECLARE(img1615470201266_dxf);
LV_IMG_DECLARE(img1615470165637_JPG);
LV_IMG_DECLARE(img1615470154936_JPG);
LV_IMG_DECLARE(img1615470208855_jpeg);
LV_IMG_DECLARE(img1614344958239_jpeg);
LV_IMG_DECLARE(img1614160720599_png);
LV_IMG_DECLARE(img1612941109111_jpg);
LV_IMG_DECLARE(imgbeijing_png);
LV_IMG_DECLARE(img1612941076475_jpg);
LV_IMG_DECLARE(img1612941006287_jpg);
LV_IMG_DECLARE(img1607507036809_png);
LV_IMG_DECLARE(img1606101128378_png);
LV_IMG_DECLARE(img1606100693921_jpg);
LV_IMG_DECLARE(img1606099918107_jpg);
LV_IMG_DECLARE(img1606099887609_jpg);
LV_IMG_DECLARE(img1606099859915_jpg);
LV_IMG_DECLARE(img1603868419064_jpg);
LV_IMG_DECLARE(img1592530624099_png);
LV_IMG_DECLARE(img1592530553072_png);
/*
* declear main_screen
*/
lv_obj_t *main_screen;
lv_obj_t *label_pH;
lv_obj_t *setting_button;
lv_obj_t *water_dis;
lv_obj_t *label_flow_water;
lv_obj_t *pH_dis;
lv_obj_t *bar_hydrogen;
lv_obj_t *text_setting;
lv_obj_t *text_hydro;
/*
* declear config_screen
*/
lv_obj_t *config_screen;
lv_obj_t *home_button;
lv_obj_t *calib_button;
lv_obj_t *wifi_button;
lv_obj_t *dropdown_select_filter;
lv_obj_t *clear_button;
lv_obj_t *edit_button;
lv_obj_t *text_info_filter_water;
/*
* declear login_screen
*/
lv_obj_t *login_screen;
lv_obj_t *image_background_login;
lv_obj_t *seeding_display;
lv_obj_t *return_home;
lv_obj_t *unlock_setting;
lv_obj_t *status_password;
/*
* declear calib_screen
*/
lv_obj_t *calib_screen;
lv_obj_t *start_calib_b;
lv_obj_t *start_calib_a;
lv_obj_t *start_calib_c;
lv_obj_t *pH_pos_a;
lv_obj_t *pH_pos_b;
lv_obj_t *pH_pos_c;
lv_obj_t *calib_to_home;

lv_widget_t g_main_screen_ids[] =
{
    {"label_pH", &label_pH},

    {"setting_button", &setting_button},

    {"water_dis", &water_dis},

    {"label_flow_water", &label_flow_water},

    {"pH_dis", &pH_dis},

    {"bar_hydrogen", &bar_hydrogen},

    {"text_setting", &text_setting},

    {"text_hydro", &text_hydro},
};
lv_widget_t g_config_screen_ids[] =
{
    {"home_button", &home_button},

    {"calib_button", &calib_button},

    {"wifi_button", &wifi_button},

    {"dropdown_select_filter", &dropdown_select_filter},

    {"clear_button", &clear_button},

    {"edit_button", &edit_button},

    {"text_info_filter_water", &text_info_filter_water},
};
lv_widget_t g_login_screen_ids[] =
{
    {"image_background_login", &image_background_login},

    {"seeding_display", &seeding_display},

    {"return_home", &return_home},

    {"unlock_setting", &unlock_setting},

    {"status_password", &status_password},
};
lv_widget_t g_calib_screen_ids[] =
{
    {"start_calib_b", &start_calib_b},

    {"start_calib_a", &start_calib_a},

    {"start_calib_c", &start_calib_c},

    {"pH_pos_a", &pH_pos_a},

    {"pH_pos_b", &pH_pos_b},

    {"pH_pos_c", &pH_pos_c},

    {"calib_to_home", &calib_to_home},
};

lv_screen_t g_screens[] =
{
    {"main_screen", &main_screen, g_main_screen_ids, (sizeof(g_main_screen_ids) / sizeof(g_main_screen_ids[0]))},
    {"config_screen", &config_screen, g_config_screen_ids, (sizeof(g_config_screen_ids) / sizeof(g_config_screen_ids[0]))},
    {"login_screen", &login_screen, g_login_screen_ids, (sizeof(g_login_screen_ids) / sizeof(g_login_screen_ids[0]))},
    {"calib_screen", &calib_screen, g_calib_screen_ids, (sizeof(g_calib_screen_ids) / sizeof(g_calib_screen_ids[0]))},
};

LV_FONT_DECLARE(ali_font_16);
LV_FONT_DECLARE(ali_font_100);
LV_FONT_DECLARE(ali_font_20);
LV_FONT_DECLARE(ali_font_21);
LV_FONT_DECLARE(ali_font_38);
LV_FONT_DECLARE(ali_font_26);
LV_FONT_DECLARE(ali_font_58);
LV_FONT_DECLARE(ali_font_30);
LV_FONT_DECLARE(ali_font_31);


void show_screen_main_screen();
void show_screen_config_screen();
void show_screen_login_screen();
void show_screen_calib_screen();
/*
* keyboard
*/
lv_obj_t *g_kb = NULL;

uint8_t check_screen=0;
uint8_t point=0;

TaskHandle_t adc_calib_task_handle = NULL;
void calib_pH(uint8_t set_point);


void adc_calib_task(void *pvParameter)
{
    point = 0;
    while(1)
    {
        if(point&&check_screen)
        {
            calib_pH(point);
            point = 0;
        }
        vTaskDelay(pdMS_TO_TICKS(500));
        // vTaskSuspend(adc_calib_task_handle);
    }

    //A task should NEVER return

