obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}

/////////////////////////////////////////
void setting_button_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    show_screen_login_screen();
}

void return_home_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    // del_screen_login_windows();
    show_screen_main_screen();
}

void unlock_setting_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    // del_screen_login_windows();
    show_screen_config_screen();
}

void home_button_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    show_screen_main_screen();
}

void calib_button_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    check_screen=1;
    show_screen_calib_screen();
}

void calib_to_home_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    check_screen=0;
    point=0;
    // vTaskResume(adc_calib_task_handle);
    show_screen_main_screen();
}

char buff_calib_text[15];
uint32_t raw_adc_ph, adc_avg;
float calib_val, calib_val_a, calib_val_b, calib_val_c;



void enable_calib_adc(uint8_t set_point)
{
    point = set_point;
}

static int i;
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"

union uconv
{
    float num32;

    struct
    {
        uint8_t a;
        uint8_t b;
        uint8_t c;
        uint8_t d;

    } bytes;

};


void save_calib_flash (uint8_t set_point, float calib_val)
{
    union uconv ph_data;
    uint8_t data_save[4];

    ph_data.num32 = calib_val;
    // Initialize NVS
    esp_err_t err = nvs_flash_init();
    nvs_handle_t my_handle;
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // NVS partition was truncated and needs to be erased
        // Retry nvs_flash_init
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK( err );
        // Open
    printf("\n");
    printf("Opening Non-Volatile Storage (NVS) handle in qmui... \r\n");
    err = nvs_open("storage", NVS_READWRITE, &my_handle);
    if (err != ESP_OK) 
    {
        printf("Error (%s) opening NVS handle!\n", esp_err_to_name(err));
    } 
    else 
    {
        printf("Done\n");

        // Open
        float val = 9231779;
        err = nvs_set_u32(my_handle, "test", val);
        err = nvs_commit(my_handle);
        err = ESP_OK;

        switch(set_point)
        {
            case 1:
                err = nvs_set_u8(my_handle, "pH_point1a", ph_data.bytes.a);
                err = nvs_set_u8(my_handle, "pH_point1b", ph_data.bytes.b);
                err = nvs_set_u8(my_handle, "pH_point1c", ph_data.bytes.c);
                err = nvs_set_u8(my_handle, "pH_point1d", ph_data.bytes.d);
                break;
            case 2:
                err = nvs_set_u8(my_handle, "pH_point2a", ph_data.bytes.a);
                err = nvs_set_u8(my_handle, "pH_point2b", ph_data.bytes.b);
                err = nvs_set_u8(my_handle, "pH_point2c", ph_data.bytes.c);
                err = nvs_set_u8(my_handle, "pH_point2d", ph_data.bytes.d);
                break;
            case 3:
                err = nvs_set_u8(my_handle, "pH_point3a", ph_data.bytes.a);
                err = nvs_set_u8(my_handle, "pH_point3b", ph_data.bytes.b);
                err = nvs_set_u8(my_handle, "pH_point3c", ph_data.bytes.c);
                err = nvs_set_u8(my_handle, "pH_point3d", ph_data.bytes.d);
                break;
        }

        printf("Updating calib data %d with value %f\r\n", set_point, calib_val);
        printf((err != ESP_OK) ? "Failed!\n" : "Done\n");

        // Commit written value.
        // After setting any values, nvs_commit() must be called to ensure changes are written
        // to flash storage. Implementations may write to storage at other times,
        // but this is not guaranteed.
        printf("Committing updates in NVS ... ");
        err = nvs_commit(my_handle);
        printf((err != ESP_OK) ? "Failed!\n" : "Done\n");
        vTaskDelay(pdMS_TO_TICKS(500));
        // Close
        nvs_close(my_handle);    
    }
}


char display_process[20];

void calib_pH(uint8_t set_point)
{
    point = 0;
    adc_avg = 0;
    raw_adc_ph = 0;
    calib_val = 0;

    switch (set_point)
    {
        case 1:
            lv_label_set_text(pH_pos_a, "watting..");
            break;   
        case 2:
            lv_label_set_text(pH_pos_b, "watting..");
            break;
        case 3:
            lv_label_set_text(pH_pos_c, "watting..");
            break;    
    }
    vTaskDelay(pdMS_TO_TICKS(1000));
    memset(buff_calib_text, 0, 15);
    adc1_config_channel_atten((adc1_channel_t)ADC_CHANNEL_4, ADC_ATTEN_DB_2_5);

    for(i=0; i < 1000; i++)
    {
        for(int a=0; a<500; a++)
        {
            raw_adc_ph   += adc1_get_raw((adc1_channel_t)ADC_CHANNEL_4);
            for(int q=0; q<500; q++){};
        }

        if(i%10 == 0)
        {
            memset(display_process, 0, 20);
            sprintf(display_process,"%d%c", i/10, '%');
            switch (set_point)
            {
                case 1:
                    lv_label_set_text(pH_pos_a, display_process);
                    break;   
                case 2:
                    lv_label_set_text(pH_pos_b, display_process);
                    break;
                case 3:
                    lv_label_set_text(pH_pos_c, display_process);
                    break;    
            }
        }

        raw_adc_ph = (float)raw_adc_ph/(float)500;
        
        adc_avg += raw_adc_ph;
        printf("count: %d adc raw : %d adc avg: %d\r\n", i, raw_adc_ph, adc_avg);
        raw_adc_ph = 0;
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    calib_val = (float)adc_avg/(float)1000;
    sprintf(buff_calib_text,"%d", (uint32_t)calib_val);
    printf("calib val: %f text:%s\r\n", calib_val, buff_calib_text);
    save_calib_flash (set_point, calib_val);
    switch (set_point)
    {
        case 1:
            calib_val_a = calib_val;
            lv_label_set_text(pH_pos_a, buff_calib_text);
            break;   
        case 2:
            calib_val_b = calib_val;
            lv_label_set_text(pH_pos_b, buff_calib_text);
            break;
        case 3:
            calib_val_c = calib_val;
            lv_label_set_text(pH_pos_c, buff_calib_text);
            break;    
    }

