obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}

void start_calib_a_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    enable_calib_adc(1);   
}

void start_calib_b_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    enable_calib_adc(2);   
}

void start_calib_c_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    enable_calib_adc(3);   
}


////////////////////////////////////////

static void g_kb_event_cb(lv_obj_t *event_kb, lv_event_t event)
{
    /* Just call the regular event handler */
    if(event == LV_EVENT_APPLY)
    {
        lv_obj_set_hidden(event_kb, true);
    }
    else if(event == LV_EVENT_CANCEL)
    {
        lv_obj_set_hidden(event_kb, true);
    }
    else
    {
        lv_keyboard_def_event_cb(event_kb, event);
    }
}
static void g_create_kb_ifneeded()
{
    if(g_kb == NULL)
    {
        g_kb = lv_keyboard_create(main_screen, NULL);
        lv_obj_set_pos(g_kb, 5, 90);
        lv_obj_set_event_cb(g_kb, g_kb_event_cb); /* Setting a custom event handler stops the keyboard from closing automatically */
        lv_obj_set_size(g_kb,  LV_HOR_RES - 10, 140);
        lv_keyboard_set_cursor_manage(g_kb, true); /* Automatically show/hide cursors on text areas */
        lv_obj_set_hidden(g_kb, true);
    }
}
static void g_show_kb()
{
    g_create_kb_ifneeded();
    lv_obj_set_parent(g_kb, lv_scr_act());
    lv_obj_set_hidden(g_kb, false);
    lv_obj_align(g_kb, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0);
}

/**
*开机启动屏相关
*/
static lv_style_t style_star, style_black, style_url;
LV_IMG_DECLARE(img_8ms_png);
LV_IMG_DECLARE(img_star);
lv_obj_t *logo;
lv_obj_t *logo_star;
lv_obj_t *url_label;
lv_obj_t *url_mask;
lv_obj_t *mask_layer;
int timer_cnt = 0;
/****
* 临时变量用于数据传输
*/
char _tmpbuf[32];




/*
* declear codes
*/



#ifndef LV_8MS_PRESET_UART_QUEUE
void lv_8ms_uart_queue_ana(uint8_t *data, int size)
{
    printf("ana:%s\n", wtctrl_json_parse((char *)data));
}
#endif
#ifndef CUSTOM_MQTT_PARSE
void lv_8ms_mqtt_received(const char *data)
{
    printf("custom:%s\n", data);
}
#endif
/*
 * callback functions begins
 */
/*
 * callback functions ends
 */
/*
* init codes
*/
void init_function()
{
#ifdef BLOCKLY_init
    blockly_init();
#endif
}

void lv_8ms_label_pH_create()
{
    label_pH = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(label_pH, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(label_pH, 360, 89);
    //set label style
    lv_obj_set_style_local_border_color(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_color(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xf3, 0x0a, 0x0e));
    lv_obj_set_style_local_text_font(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_100);

    lv_label_set_text(label_pH, "10.69");
    lv_label_set_align(label_pH, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_label_pH_EVENT_HANDLER
    lv_obj_set_event_cb(label_pH, label_pH_event_handler);
#endif
    if(label_pH->coords.x2 - label_pH->coords.x1 < 360)
    {
        int x_offset = (360 - (label_pH->coords.x2 - label_pH->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(label_pH->coords.y2 - label_pH->coords.y1 < 89)
    {
        int y_offset = (89 - (label_pH->coords.y2 - label_pH->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(label_pH, 53, 48);

}
void lv_8ms_setting_button_create()
{
    setting_button = lv_img_create(main_screen, NULL);
    lv_img_set_src(setting_button, &img1627285477548_png);
    lv_obj_set_pos(setting_button, 402, 222);
    lv_obj_set_click(setting_button, true);
    lv_obj_set_style_local_image_recolor(setting_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(setting_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_setting_button_EVENT_HANDLER
    lv_obj_set_event_cb(setting_button, setting_button_event_handler);
    // #endif
}
void lv_8ms_water_dis_create()
{
    water_dis = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(water_dis, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(water_dis, 261, 53);
    //set label style
    lv_obj_set_style_local_text_color(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x7e, 0xd3, 0x21));
    lv_obj_set_style_local_text_font(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

    lv_label_set_text(water_dis, "Lít H2O Hydrogen đã dùng");
    lv_label_set_align(water_dis, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_water_dis_EVENT_HANDLER
    lv_obj_set_event_cb(water_dis, water_dis_event_handler);
#endif
    if(water_dis->coords.x2 - water_dis->coords.x1 < 261)
    {
        int x_offset = (261 - (water_dis->coords.x2 - water_dis->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(water_dis->coords.y2 - water_dis->coords.y1 < 53)
    {
        int y_offset = (53 - (water_dis->coords.y2 - water_dis->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(water_dis, 205, 159);

}
void lv_8ms_label_flow_water_create()
{
    label_flow_water = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(label_flow_water, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(label_flow_water, 178, 54);
    //set label style
    lv_obj_set_style_local_radius(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 12);
    lv_obj_set_style_local_border_color(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_color(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x7e, 0xd3, 0x21));
    lv_obj_set_style_local_text_font(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_31);

