obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
    lv_label_set_text(label_flow_water, "123124");
    lv_label_set_align(label_flow_water, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_label_flow_water_EVENT_HANDLER
    lv_obj_set_event_cb(label_flow_water, label_flow_water_event_handler);
#endif
    if(label_flow_water->coords.x2 - label_flow_water->coords.x1 < 178)
    {
        int x_offset = (178 - (label_flow_water->coords.x2 - label_flow_water->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(label_flow_water->coords.y2 - label_flow_water->coords.y1 < 54)
    {
        int y_offset = (54 - (label_flow_water->coords.y2 - label_flow_water->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(label_flow_water, 20, 158);

}
void lv_8ms_pH_dis_create()
{
    pH_dis = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(pH_dis, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(pH_dis, 65, 46);
    //set label style
    lv_obj_set_style_local_text_color(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xf3, 0x0a, 0x0e));
    lv_obj_set_style_local_text_font(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_38);

    lv_label_set_text(pH_dis, "pH");
    lv_label_set_align(pH_dis, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_pH_dis_EVENT_HANDLER
    lv_obj_set_event_cb(pH_dis, pH_dis_event_handler);
#endif
    if(pH_dis->coords.x2 - pH_dis->coords.x1 < 65)
    {
        int x_offset = (65 - (pH_dis->coords.x2 - pH_dis->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(pH_dis->coords.y2 - pH_dis->coords.y1 < 46)
    {
        int y_offset = (46 - (pH_dis->coords.y2 - pH_dis->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(pH_dis, 355, 21);

}
void lv_8ms_bar_hydrogen_create()
{
    bar_hydrogen = lv_bar_create(main_screen, NULL);
    lv_obj_set_size(bar_hydrogen, 348, 40);
    lv_obj_set_pos(bar_hydrogen, 30, 234);
    lv_bar_set_anim_time(bar_hydrogen, 1000);
    lv_bar_set_value(bar_hydrogen, 48, LV_ANIM_ON);

    /*Create a bar, an indicator and a knob style*/
    //set main part style
    lv_obj_set_style_local_bg_color(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xff, 0xff, 0xff));
    lv_obj_set_style_local_bg_grad_color(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xff, 0xff, 0xff));
    lv_obj_set_style_local_pad_top(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_bottom(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_left(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_right(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    //set indic style
    lv_obj_set_style_local_bg_color(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_bg_grad_color(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_radius(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_RADIUS_CIRCLE);
    lv_obj_set_style_local_pad_top(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_bottom(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_left(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_right(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
}
void lv_8ms_text_setting_create()
{
    text_setting = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(text_setting, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_setting, 92, 21);
    //set label style
    lv_obj_set_style_local_text_color(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xdd, 0xdf, 0xc1));
    lv_obj_set_style_local_text_font(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

    lv_label_set_text(text_setting, "Setting");
    lv_label_set_align(text_setting, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_setting_EVENT_HANDLER
    lv_obj_set_event_cb(text_setting, text_setting_event_handler);
#endif
    if(text_setting->coords.x2 - text_setting->coords.x1 < 92)
    {
        int x_offset = (92 - (text_setting->coords.x2 - text_setting->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_setting->coords.y2 - text_setting->coords.y1 < 21)
    {
        int y_offset = (21 - (text_setting->coords.y2 - text_setting->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_setting, 388, 286);

}
void lv_8ms_text_hydro_create()
{
    text_hydro = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(text_hydro, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_hydro, 156, 40);
    //set label style
    lv_obj_set_style_local_text_color(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_font(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_30);

    lv_label_set_text(text_hydro, "Hydrogen");
    lv_label_set_align(text_hydro, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_hydro_EVENT_HANDLER
    lv_obj_set_event_cb(text_hydro, text_hydro_event_handler);
#endif
    if(text_hydro->coords.x2 - text_hydro->coords.x1 < 156)
    {
        int x_offset = (156 - (text_hydro->coords.x2 - text_hydro->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_hydro->coords.y2 - text_hydro->coords.y1 < 40)
    {
        int y_offset = (40 - (text_hydro->coords.y2 - text_hydro->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_hydro, 136, 274);

