obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}
void lv_8ms_home_button_create()
{
    home_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(home_button, &img1627285431674_png);
    lv_obj_set_pos(home_button, 211, 243);
    lv_obj_set_click(home_button, true);
    lv_obj_set_style_local_image_recolor(home_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(home_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_home_button_EVENT_HANDLER
    lv_obj_set_event_cb(home_button, home_button_event_handler);
    // #endif
}
void lv_8ms_calib_button_create()
{
    calib_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(calib_button, &img1629631072036_png);
    lv_obj_set_pos(calib_button, 119, 243);
    lv_obj_set_click(calib_button, true);
    lv_obj_set_style_local_image_recolor(calib_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(calib_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_calib_button_EVENT_HANDLER
    lv_obj_set_event_cb(calib_button, calib_button_event_handler);
    // #endif
}
void lv_8ms_wifi_button_create()
{
    wifi_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(wifi_button, &img1627285685903_png);
    lv_obj_set_pos(wifi_button, 303, 243);
    lv_obj_set_click(wifi_button, true);
    lv_obj_set_style_local_image_recolor(wifi_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(wifi_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
#ifdef BLOCKLY_wifi_button_EVENT_HANDLER
    lv_obj_set_event_cb(wifi_button, wifi_button_event_handler);
#endif
}
void lv_8ms_dropdown_select_filter_create()
{
    dropdown_select_filter = lv_dropdown_create(config_screen, NULL);
    lv_obj_set_size(dropdown_select_filter, 123, 86);
    lv_obj_set_pos(dropdown_select_filter, 8, 11);
    lv_dropdown_set_options(dropdown_select_filter,
                            "Filter 1""\n"
                            "Filter 2""\n"
                            "Filter 3""\n"
                            "Filter 4""\n"
                            "Filter 5""\n"
                            "Filter 6""\n"
                            "Filter 7""\n"
                            "Filter 8""\n"
                            ""
                           );
    lv_dropdown_set_draw_arrow(dropdown_select_filter, true);
#ifdef BLOCKLY_dropdown_select_filter_EVENT_HANDLER
    lv_obj_set_event_cb(dropdown_select_filter, dropdown_select_filter_event_handler);
#endif
    /*
    设置字体大小颜色
    */
    lv_obj_set_style_local_text_color(dropdown_select_filter, LV_DROPDOWN_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x15, 0x7a, 0xe9));
    lv_obj_set_style_local_text_color(dropdown_select_filter, LV_DROPDOWN_PART_LIST, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x15, 0x7a, 0xe9));
    /*
    设置字体大小颜色结束
    */
}
void lv_8ms_clear_button_create()
{
    clear_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(clear_button, &img1627300475973_png);
    lv_obj_set_pos(clear_button, 399, 20);
#ifdef BLOCKLY_clear_button_EVENT_HANDLER
    lv_obj_set_event_cb(clear_button, clear_button_event_handler);
#endif
}
void lv_8ms_edit_button_create()
{
    edit_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(edit_button, &img1627300495627_png);
    lv_obj_set_pos(edit_button, 399, 125);
#ifdef BLOCKLY_edit_button_EVENT_HANDLER
    lv_obj_set_event_cb(edit_button, edit_button_event_handler);
#endif
}
void lv_8ms_text_info_filter_water_create()
{
    text_info_filter_water = lv_label_create(config_screen, NULL);
    lv_label_set_long_mode(text_info_filter_water, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_info_filter_water, 227, 215);
    //set label style
    lv_obj_set_style_local_radius(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 10);
    lv_obj_set_style_local_border_color(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_border_width(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 2);
    lv_obj_set_style_local_text_color(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_font(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

    lv_label_set_text(text_info_filter_water, "Thông tin lõi 1");
    lv_label_set_align(text_info_filter_water, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_info_filter_water_EVENT_HANDLER
    lv_obj_set_event_cb(text_info_filter_water, text_info_filter_water_event_handler);
#endif
    if(text_info_filter_water->coords.x2 - text_info_filter_water->coords.x1 < 227)
    {
        int x_offset = (227 - (text_info_filter_water->coords.x2 - text_info_filter_water->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_info_filter_water->coords.y2 - text_info_filter_water->coords.y1 < 215)
    {
        int y_offset = (215 - (text_info_filter_water->coords.y2 - text_info_filter_water->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_info_filter_water, 140, 12);

}
void lv_8ms_image_background_login_create()
{
    image_background_login = lv_img_create(login_screen, NULL);
    lv_img_set_src(image_background_login, &img1627285614032_png);
    lv_obj_set_pos(image_background_login, 0, 0);
#ifdef BLOCKLY_image_background_login_EVENT_HANDLER
    lv_obj_set_event_cb(image_background_login, image_background_login_event_handler);
#endif
}
void lv_8ms_seeding_display_create()
{
    seeding_display = lv_label_create(login_screen, NULL);
    lv_label_set_long_mode(seeding_display, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(seeding_display, 245, 40);
    //set label style
    lv_obj_set_style_local_radius(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 12);
    lv_obj_set_style_local_border_width(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 1);
    lv_obj_set_style_local_text_color(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x90, 0x13, 0xfe));
    lv_obj_set_style_local_text_font(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_21);

    lv_label_set_text(seeding_display, "12E32A3CF5A1");
    lv_label_set_align(seeding_display, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_seeding_display_EVENT_HANDLER
    lv_obj_set_event_cb(seeding_display, seeding_display_event_handler);
#endif
    if(seeding_display->coords.x2 - seeding_display->coords.x1 < 245)
    {
        int x_offset = (245 - (seeding_display->coords.x2 - seeding_display->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(seeding_display->coords.y2 - seeding_display->coords.y1 < 40)
    {
        int y_offset = (40 - (seeding_display->coords.y2 - seeding_display->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(seeding_display, 114, 18);

