obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}
void lv_8ms_return_home_create()
{
    return_home = lv_img_create(login_screen, NULL);
    lv_img_set_src(return_home, &img1627313782026_png);
    lv_obj_set_pos(return_home, 123, 216);
    lv_obj_set_click(return_home, true);
    lv_obj_set_style_local_image_recolor(return_home, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(return_home, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_return_home_EVENT_HANDLER
    lv_obj_set_event_cb(return_home, return_home_event_handler);
    // #endif
}
void lv_8ms_unlock_setting_create()
{
    unlock_setting = lv_img_create(login_screen, NULL);
    lv_img_set_src(unlock_setting, &img1627313837606_png);
    lv_obj_set_pos(unlock_setting, 295, 216);
    lv_obj_set_click(unlock_setting, true);
    lv_obj_set_style_local_image_recolor(unlock_setting, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(unlock_setting, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_unlock_setting_EVENT_HANDLER
    lv_obj_set_event_cb(unlock_setting, unlock_setting_event_handler);
    // #endif
}
void lv_8ms_status_password_create()
{
    status_password = lv_label_create(login_screen, NULL);
    lv_label_set_long_mode(status_password, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(status_password, 354, 40);
    //set label style
    lv_obj_set_style_local_text_color(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xe6, 0x0f, 0x0f));
    lv_obj_set_style_local_text_font(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_26);

    lv_label_set_text(status_password, "enter password");
    lv_label_set_align(status_password, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_status_password_EVENT_HANDLER
    lv_obj_set_event_cb(status_password, status_password_event_handler);
#endif
    if(status_password->coords.x2 - status_password->coords.x1 < 354)
    {
        int x_offset = (354 - (status_password->coords.x2 - status_password->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(status_password->coords.y2 - status_password->coords.y1 < 40)
    {
        int y_offset = (40 - (status_password->coords.y2 - status_password->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(status_password, 63, 78);

}
void lv_8ms_start_calib_b_create()
{
    start_calib_b = lv_img_create(calib_screen, NULL);
    lv_img_set_src(start_calib_b, &img1629631902349_png);
    lv_obj_set_pos(start_calib_b, 294, 117);
    lv_obj_set_click(start_calib_b, true);
    lv_obj_set_style_local_image_recolor(start_calib_b, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(start_calib_b, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
// #ifdef BLOCKLY_start_calib_b_EVENT_HANDLER
    lv_obj_set_event_cb(start_calib_b, start_calib_b_event_handler);
// #endif
}
void lv_8ms_start_calib_a_create()
{
    start_calib_a = lv_img_create(calib_screen, NULL);
    lv_img_set_src(start_calib_a, &img1629631902349_png);
    lv_obj_set_pos(start_calib_a, 294, 25);
    lv_obj_set_click(start_calib_a, true);
    lv_obj_set_style_local_image_recolor(start_calib_a, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(start_calib_a, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
// #ifdef BLOCKLY_start_calib_a_EVENT_HANDLER
    lv_obj_set_event_cb(start_calib_a, start_calib_a_event_handler);
// #endif
}
void lv_8ms_start_calib_c_create()
{
    start_calib_c = lv_img_create(calib_screen, NULL);
    lv_img_set_src(start_calib_c, &img1629631902349_png);
    lv_obj_set_pos(start_calib_c, 294, 209);
    lv_obj_set_click(start_calib_c, true);
    lv_obj_set_style_local_image_recolor(start_calib_c, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(start_calib_c, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
// #ifdef BLOCKLY_start_calib_c_EVENT_HANDLER
    lv_obj_set_event_cb(start_calib_c, start_calib_c_event_handler);
// #endif
}
void lv_8ms_pH_pos_a_create()
{
    pH_pos_a = lv_label_create(calib_screen, NULL);
    lv_label_set_long_mode(pH_pos_a, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(pH_pos_a, 280, 79);
    //set label style
    lv_obj_set_style_local_text_color(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x0d, 0xa2, 0xdb));
    lv_obj_set_style_local_text_font(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_58);

    lv_label_set_text(pH_pos_a, "calib 4.01");
    lv_label_set_align(pH_pos_a, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_pH_pos_a_EVENT_HANDLER
    lv_obj_set_event_cb(pH_pos_a, pH_pos_a_event_handler);
#endif
    if(pH_pos_a->coords.x2 - pH_pos_a->coords.x1 < 280)
    {
        int x_offset = (280 - (pH_pos_a->coords.x2 - pH_pos_a->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(pH_pos_a->coords.y2 - pH_pos_a->coords.y1 < 79)
    {
        int y_offset = (79 - (pH_pos_a->coords.y2 - pH_pos_a->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(pH_pos_a, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(pH_pos_a, 0, 17);

}
void lv_8ms_pH_pos_b_create()
{
    pH_pos_b = lv_label_create(calib_screen, NULL);
    lv_label_set_long_mode(pH_pos_b, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(pH_pos_b, 280, 79);
    //set label style
    lv_obj_set_style_local_text_color(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x0d, 0xa2, 0xdb));
    lv_obj_set_style_local_text_font(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_58);

    lv_label_set_text(pH_pos_b, "calib 6.86");
    lv_label_set_align(pH_pos_b, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_pH_pos_b_EVENT_HANDLER
    lv_obj_set_event_cb(pH_pos_b, pH_pos_b_event_handler);
#endif
    if(pH_pos_b->coords.x2 - pH_pos_b->coords.x1 < 280)
    {
        int x_offset = (280 - (pH_pos_b->coords.x2 - pH_pos_b->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(pH_pos_b->coords.y2 - pH_pos_b->coords.y1 < 79)
    {
        int y_offset = (79 - (pH_pos_b->coords.y2 - pH_pos_b->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(pH_pos_b, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(pH_pos_b, 0, 110)
;
}
void lv_8ms_pH_pos_c_create()
{
    pH_pos_c = lv_label_create(calib_screen, NULL);
    lv_label_set_long_mode(pH_pos_c, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(pH_pos_c, 280, 79);
    //set label style
    lv_obj_set_style_local_text_color(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x0d, 0xa2, 0xdb));
    lv_obj_set_style_local_text_font(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_58);

    lv_label_set_text(pH_pos_c, "calib 9.18");
    lv_label_set_align(pH_pos_c, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_pH_pos_c_EVENT_HANDLER
    lv_obj_set_event_cb(pH_pos_c, pH_pos_c_event_handler);
#endif
    if(pH_pos_c->coords.x2 - pH_pos_c->coords.x1 < 280)
    {
        int x_offset = (280 - (pH_pos_c->coords.x2 - pH_pos_c->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(pH_pos_c->coords.y2 - pH_pos_c->coords.y1 < 79)
    {
        int y_offset = (79 - (pH_pos_c->coords.y2 - pH_pos_c->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(pH_pos_c, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(pH_pos_c, 0, 203);

